riraosan/ESP32MSGraph/src/ESP32MSGraph.cpp
  serializeJsonPretty(responseDoc, Serial);

  _server->send(200, "application/json", responseDoc.as<String>());
}

// Delete EEPROM by removing the trailing sequence, remove context file
void ESP32MSGraph::handleClearSettings() {
  log_d("handleClearSettings()");

  for (int t = 0; t < 4; t++) {
    EEPROM.write(t, 0);
  }
  EEPROM.commit();
  removeContext();

  _server->send(200, "application/json", "{\"action\": \"clear_settings\", \"error\": false}");
  ESP.restart();
}

void ESP32MSGraph::startDevicelogin() {
  // Only if not already started
  if (_state != SMODEDEVICELOGINSTARTED) {
    log_d("handleStartDevicelogin()");

    // Request device login context
    DynamicJsonDocument doc(JSON_OBJECT_SIZE(6) + 540);

    bool res = requestJsonApi(doc,
                              DeserializationOption::Filter(_loginFilter),
                              "https://login.microsoftonline.com/" + _paramTenantValue + "/oauth2/v2.0/devicecode",
                              "client_id=" + _paramClientIdValue + "&scope=offline_access%20openid%20Presence.Read");

    if (res && doc.containsKey("device_code") && doc.containsKey("user_code") && doc.containsKey("interval") && doc.containsKey("verification_uri") && doc.containsKey("message")) {
      // Save device_code, user_code and interval
      device_code = doc["device_code"].as<String>();
      user_code   = doc["user_code"].as<String>();
      interval    = doc["interval"].as<unsigned int>();

      // Prepare response JSON
      DynamicJsonDocument responseDoc(JSON_OBJECT_SIZE(3));
      responseDoc["user_code"]        = doc["user_code"].as<const char*>();
      responseDoc["verification_uri"] = doc["verification_uri"].as<const char*>();
      responseDoc["message"]          = doc["message"].as<const char*>();

      // Set state, update polling timestamp
      _state     = SMODEDEVICELOGINSTARTED;
      _tsPolling = millis() + (interval * 1000);

      // Send JSON response
      _server->send(200, "application/json", responseDoc.as<String>());
    } else {
      _server->send(500, "application/json", "{\"error\": \"devicelogin_unknown_response\"}");
    }
  } else {
    _server->send(409, "application/json", "{\"error\": \"devicelogin_already_running\"}");
  }
}

/**
 * SPIFFS webserver
 */
bool ESP32MSGraph::exists(String path) {
  bool yes  = false;
  File file = SPIFFS.open(path, "r");
  if (!file.isDirectory()) {
    yes = true;
  }
  file.close();
  return yes;
}

void ESP32MSGraph::handleMinimalUpload() {
  _server->sendHeader("Access-Control-Allow-Origin", "*");
  _server->send(200, "text/html", "<!DOCTYPE html>\
			<html>\
			<head>\
				<title>ESP8266 Upload</title>\
				<meta charset=\"utf-8\">\
				<meta http-equiv=\"X-UA-Compatible\" content=\"IE=edge\">\
				<meta name=\"viewport\" content=\"width=device-width, initial-scale=1\">\
			</head>\
			<body>\
				<form action=\"/fs/upload\" method=\"post\" enctype=\"multipart/form-data\">\
				<input type=\"file\" name=\"data\">\
				<input type=\"text\" name=\"path\" value=\"/\">\
				<button>Upload</button>\
				</form>\
			</body>\
			</html>");
}

void ESP32MSGraph::handleFileUpload() {
  File        fsUploadFile;
  HTTPUpload& upload = _server->upload();
  if (upload.status == UPLOAD_FILE_START) {
    String filename = upload.filename;
    if (!filename.startsWith("/")) {
      filename = "/" + filename;
    }
    log_d("handleFileUpload Name: %s", filename);
    fsUploadFile = SPIFFS.open(filename, "w");
    filename     = String();
  } else if (upload.status == UPLOAD_FILE_WRITE) {
    // DBG_OUTPUT_PORT.print("handleFileUpload Data: "); DBG_OUTPUT_PORT.println(upload.currentSize);
    if (fsUploadFile) {
      fsUploadFile.write(upload.buf, upload.currentSize);
    }
  } else if (upload.status == UPLOAD_FILE_END) {
    if (fsUploadFile) {
      fsUploadFile.close();
    }
    log_d("handleFileUpload Size: %d", upload.totalSize);
  }
}

void ESP32MSGraph::handleFileDelete() {
  if (_server->args() == 0) {
    return _server->send(500, "text/plain", "BAD ARGS");
  }
  String path = _server->arg(0);
  log_d("handleFileDelete: %s", path);
  if (path == "/") {
    return _server->send(500, "text/plain", "BAD PATH");
  }
  if (!exists(path)) {
    return _server->send(404, "text/plain", "FileNotFound");
  }
  SPIFFS.remove(path);
  _server->send(200, "text/plain", "");
  path = String();
}

void ESP32MSGraph::handleFileList() {
  if (!_server->hasArg("dir")) {
    _server->send(500, "text/plain", "BAD ARGS");
    return;
  }

  String path = _server->arg("dir");
  log_d("handleFileList: %s", path);

  File root     = SPIFFS.open(path);
  path          = String();
  String output = "[";
  if (root.isDirectory()) {
    File file = root.openNextFile();
    while (file) {
      if (output != "[") {
        output += ',';
      }
      output += "{\"type\":\"";
      output += (file.isDirectory()) ? "dir" : "file";
      output += "\",\"name\":\"";
      output += String(file.name()).substring(1);
      output += "\"}";
      file = root.openNextFile();
    }
  }
  output += "]";
  _server->send(200, "text/json", output);
}

String ESP32MSGraph::getContentType(String filename) {
  if (_server->hasArg("download")) {
    return "application/octet-stream";
  } else if (filename.endsWith(".htm")) {
    return "text/html";
  } else if (filename.endsWith(".html")) {
    return "text/html";
  } else if (filename.endsWith(".css")) {
    return "text/css";
  } else if (filename.endsWith(".js")) {
    return "application/javascript";
  } else if (filename.endsWith(".png")) {
    return "image/png";
  } else if (filename.endsWith(".gif")) {
    return "image/gif";
  } else if (filename.endsWith(".jpg")) {
    return "image/jpeg";
  } else if (filename.endsWith(".ico")) {
    return "image/x-icon";
  } else if (filename.endsWith(".xml")) {
    return "text/xml";
  } else if (filename.endsWith(".pdf")) {
    return "application/x-pdf";
  } else if (filename.endsWith(".zip")) {
    return "application/x-zip";
  } else if (filename.endsWith(".gz")) {
    return "application/x-gzip";
  }
  return "text/plain";
}

bool ESP32MSGraph::handleFileRead(String path) {
  log_d("handleFileRead: %s", path);
  if (path.endsWith("/")) {
    path += "index.htm";
  }
  String contentType = getContentType(path);
  String pathWithGz  = path + ".gz";
  if (exists(pathWithGz) || exists(path)) {
    if (exists(pathWithGz)) {
      path += ".gz";
    }
    File file = SPIFFS.open(path, "r");
    _server->streamFile(file, contentType);
    file.close();
    return true;
  }
  return false;
}

// Poll for access token
void ESP32MSGraph::pollForToken(void) {
  String payload = "client_id=" + String(_paramClientIdValue) + "&grant_type=urn:ietf:params:oauth:grant-type:device_code&device_code=" + device_code;

  DynamicJsonDocument responseDoc(JSON_OBJECT_SIZE(7) + 5000);

  bool res = requestJsonApi(responseDoc,
                            DeserializationOption::Filter(_refleshtokenFilter),
                            "https://login.microsoftonline.com/" + String(_paramTenantValue) + "/oauth2/v2.0/token",
                            payload);

  if (!res) {
    _state = SMODEDEVICELOGINFAILED;
  } else if (responseDoc.containsKey("error")) {
    const char* _error             = responseDoc["error"];
    const char* _error_description = responseDoc["error_description"];

