riraosan/ESP32MSGraph/src/ESP32MSGraph.cpp
    if (strcmp(_error, "authorization_pending") == 0) {
      log_i("pollForToken() - Wating for authorization by user: %s", _error_description);
    } else {
      log_e("pollForToken() - Unexpected error: %s, %s", _error, _error_description);
      _state = SMODEDEVICELOGINFAILED;
    }
  } else {
    if (responseDoc.containsKey("access_token") && responseDoc.containsKey("refresh_token") && responseDoc.containsKey("id_token")) {
      // Save tokens and expiration
      unsigned int _expires_in = responseDoc["expires_in"].as<unsigned int>();
      access_token             = responseDoc["access_token"].as<String>();
      refresh_token            = responseDoc["refresh_token"].as<String>();
      id_token                 = responseDoc["id_token"].as<String>();
      _expires                 = millis() + (_expires_in * 1000);  // Calculate timestamp when token _expires

      // Set state
      _state = SMODEAUTHREADY;

      log_i("Set : SMODEAUTHREADY");
    } else {
      log_e("pollForToken() - Unknown response: ");
    }
  }
}

// Refresh the access token
bool ESP32MSGraph::refreshToken(void) {
  bool success = false;
  // See: https://docs.microsoft.com/de-de/azure/active-directory/develop/v1-protocols-oauth-code#refreshing-the-access-tokens
  String payload = "client_id=" + _paramClientIdValue + "&grant_type=refresh_token&refresh_token=" + refresh_token;
  log_d("refreshToken()");

  DynamicJsonDocument responseDoc(6144);  // from ArduinoJson Assistant

  bool res = requestJsonApi(responseDoc,
                            DeserializationOption::Filter(_refleshtokenFilter),
                            "https://login.microsoftonline.com/" + _paramTenantValue + "/oauth2/v2.0/token",
                            payload);

  // Replace tokens and expiration
  if (res && responseDoc.containsKey("access_token") && responseDoc.containsKey("refresh_token")) {
    if (!responseDoc["access_token"].isNull()) {
      access_token = responseDoc["access_token"].as<String>();
      success      = true;
    }
    if (!responseDoc["refresh_token"].isNull()) {
      refresh_token = responseDoc["refresh_token"].as<String>();
      success       = true;
    }
    if (!responseDoc["id_token"].isNull()) {
      id_token = responseDoc["id_token"].as<String>();
    }
    if (!responseDoc["expires_in"].isNull()) {
      int _expires_in = responseDoc["expires_in"].as<unsigned int>();
      _expires        = millis() + (_expires_in * 1000);  // Calculate timestamp when token _expires
    }

    log_d("refreshToken() - Success");
    _state = SMODEPOLLPRESENCE;
  } else {
    log_d("refreshToken() - Error:");
    // Set retry after timeout
    _tsPolling = millis() + (DEFAULT_ERROR_RETRY_INTERVAL * 1000);
  }
  return success;
}

/*
IOTWEBCONF_STATE_NOT_CONFIGURED || IOTWEBCONF_STATE_AP_MODE

SMODEWIFICONNECTING SMODEWIFICONNECTING
SMODEWIFICONNECTED SMODEWIFICONNECTED

SMODEDEVICELOGINSTARTED

SMODEPOLLPRESENCE

SMODEREFRESHTOKEN
*/
// Implementation of a statemachine to handle the different application states
void ESP32MSGraph::statemachine(void) {
  // Statemachine: Check states of iotWebConf to detect AP mode and WiFi Connection attempt
  byte iotWebConfState = _iotWebConf->getState();
  if (iotWebConfState != _lastIotWebConfState) {
    if (iotWebConfState == IOTWEBCONF_STATE_NOT_CONFIGURED || iotWebConfState == IOTWEBCONF_STATE_AP_MODE) {
      log_d("Detected AP mode");
      setAnimation(0, FX_MODE_THEATER_CHASE, WHITE);
    }
    if (iotWebConfState == IOTWEBCONF_STATE_CONNECTING) {
      log_d("WiFi connecting");
      _state = SMODEWIFICONNECTING;
    }
  }
  _lastIotWebConfState = iotWebConfState;

  // Statemachine: Wifi connection start
  if (_state == SMODEWIFICONNECTING && _laststate != SMODEWIFICONNECTING) {
    setAnimation(0, FX_MODE_THEATER_CHASE, BLUE);
  }

  // Statemachine: After wifi is connected
  if (_state == SMODEWIFICONNECTED && _laststate != SMODEWIFICONNECTED) {
    setAnimation(0, FX_MODE_THEATER_CHASE, GREEN);
    // startMDNS();
    loadContext();
    // WiFi client
    log_d("Wifi connected, waiting for requests ...");
  }

  // Statemachine: Devicelogin started
  if (_state == SMODEDEVICELOGINSTARTED) {
    // log_d("SMODEDEVICELOGINSTARTED");
    if (_laststate != SMODEDEVICELOGINSTARTED) {
      setAnimation(0, FX_MODE_THEATER_CHASE, PURPLE);
      log_d("Device login failed");
    }
    if (millis() >= _tsPolling) {
      pollForToken();
      _tsPolling = millis() + (interval * 1000);
      log_d("pollForToken");
    }
  }

  // Statemachine: Devicelogin failed
  if (_state == SMODEDEVICELOGINFAILED) {
    log_d("Device login failed");
    _state = SMODEWIFICONNECTED;  // Return back to initial mode
  }

  // Statemachine: Auth is ready, start polling for presence immediately
  if (_state == SMODEAUTHREADY) {
    saveContext();
    _state     = SMODEPOLLPRESENCE;
    _tsPolling = millis();
  }

  // Statemachine: Poll for presence information, even if there was a error before (handled below)
  if (_state == SMODEPOLLPRESENCE) {
    if (millis() >= _tsPolling) {
      log_i("%s", "Polling presence info ...");
      pollPresence();
      _tsPolling = millis() + (atoi(_paramPollIntervalValue.c_str()) * 1000);
      log_i("--> Availability: %s, Activity: %s", availability.c_str(), activity.c_str());
    }

    if (getTokenLifetime() < TOKEN_REFRESH_TIMEOUT) {
      log_w("Token needs refresh, valid for %d s.", getTokenLifetime());
      _state = SMODEREFRESHTOKEN;
    }
  }

  // Statemachine: Refresh token
  if (_state == SMODEREFRESHTOKEN) {
    if (_laststate != SMODEREFRESHTOKEN) {
      setAnimation(0, FX_MODE_THEATER_CHASE, RED);
    }
    if (millis() >= _tsPolling) {
      boolean success = refreshToken();
      if (success) {
        saveContext();
      }
    }
  }

  // Statemachine: Polling presence failed
  if (_state == SMODEPRESENCEREQUESTERROR) {
    if (_laststate != SMODEPRESENCEREQUESTERROR) {
      _retries = 0;
    }

    log_e("Polling presence failed, retry #%d.", _retries);
    if (_retries >= 5) {
      // Try token refresh
      _state = SMODEREFRESHTOKEN;
    } else {
      _state = SMODEPOLLPRESENCE;
    }
  }

  // Update laststate
  if (_laststate != _state) {
    _laststate = _state;
    log_d("======================================================================");
  }
}

bool ESP32MSGraph::loadContext(void) {
  File    file    = SPIFFS.open(CONTEXT_FILE);
  boolean success = false;

  if (!file) {
    log_d("loadContext() - No file found");
  } else {
    size_t size = file.size();
    if (size == 0) {
      log_d("loadContext() - File empty");
    } else {
      const int            capacity = JSON_OBJECT_SIZE(3) + 10000;
      DynamicJsonDocument  contextDoc(capacity);
      DeserializationError err = deserializeJson(contextDoc, file);

      if (err) {
        log_d("loadContext() - deserializeJson() failed with code: %s", err.c_str());
      } else {
        int numSettings = 0;
        if (!contextDoc["access_token"].isNull()) {
          access_token = contextDoc["access_token"].as<String>();
          numSettings++;
        }
        if (!contextDoc["refresh_token"].isNull()) {
          refresh_token = contextDoc["refresh_token"].as<String>();
          numSettings++;
        }
        if (!contextDoc["id_token"].isNull()) {
          id_token = contextDoc["id_token"].as<String>();
          numSettings++;
        }
        if (numSettings == 3) {
          success = true;
          log_d("loadContext() - Success");
          if (_paramClientIdValue.length() > 0 && _paramTenantValue.length() > 0) {
            log_d("loadContext() - Next: Refresh token.");
            _state = SMODEREFRESHTOKEN;
          } else {
            log_d("loadContext() - No client id or tenant setting found.");
          }
        } else {
          log_e("loadContext() - ERROR Number of valid settings in file: %d, should be 3.", numSettings);
        }
        // log_d(contextDoc.as<String>());
      }
    }
    file.close();
  }

  return success;
}

