riraosan/ESP32MSGraph/src/ESP32MSGraph.cpp
// Save context information to file in SPIFFS
void ESP32MSGraph::saveContext(void) {
  const size_t        capacity = JSON_OBJECT_SIZE(3) + 5000;
  DynamicJsonDocument contextDoc(capacity);
  contextDoc["access_token"]  = access_token.c_str();
  contextDoc["refresh_token"] = refresh_token.c_str();
  contextDoc["id_token"]      = id_token.c_str();

  File   contextFile  = SPIFFS.open(CONTEXT_FILE, FILE_WRITE);
  size_t bytesWritten = serializeJsonPretty(contextDoc, contextFile);
  contextFile.close();
  log_d("saveContext() - Success: %d", bytesWritten);
  // log_d("%s", contextDoc.as<String>().c_str());
}

// Get presence information
// user method
void ESP32MSGraph::pollPresence(void) {
  log_d("pollPresence()");
  // See: https://github.com/microsoftgraph/microsoft-graph-docs/blob/ananya/api-reference/beta/resources/presence.md
  const size_t        capacity = JSON_OBJECT_SIZE(4) + 500;
  DynamicJsonDocument responseDoc(capacity);

  // TODO
  bool res = requestJsonApi(responseDoc,
                            DeserializationOption::Filter(_presenceFilter),
                            "https://graph.microsoft.com/v1.0/me/presence",
                            "",
                            "GET",
                            true);

  if (!res) {
    _state = SMODEPRESENCEREQUESTERROR;
    _retries++;
    log_e("Presence request error. retry:#%d", _retries);
  } else if (responseDoc.containsKey("error")) {
    const char* _error_code = responseDoc["error"]["code"];
    if (strcmp(_error_code, "InvalidAuthenticationToken")) {
      log_e("pollPresence() - Refresh needed");
      _tsPolling = millis();
      _state     = SMODEREFRESHTOKEN;
    } else {
      log_e("pollPresence() - Error: %s\n", _error_code);
      _state = SMODEPRESENCEREQUESTERROR;
      _retries++;
    }
  } else {
    log_i("success to get Presence");

    // Store presence info
    availability = responseDoc["availability"].as<String>();
    activity     = responseDoc["activity"].as<String>();
    _retries     = 0;

    setPresenceAnimation();
  }
}

// Neopixel control
// user method
void ESP32MSGraph::setAnimation(uint8_t segment, uint8_t mode, uint32_t color, uint16_t speed, bool reverse) {
  uint16_t startLed, endLed = 0;

  // Support only one segment for the moment
  if (segment == 0) {
    startLed = 0;
    // endLed   = numberLeds;
    endLed = ws2812fx.getLength();
  }

  log_i("setAnimation: %d, %d-%d, Mode: %d, Color: %d, Speed: %d", segment, startLed, endLed, mode, color, speed);

  ws2812fx.setSegment(segment, startLed, endLed, mode, color, speed, reverse);
}

// user method...
//  - Activity
//  Available,
//  Away,
//  BeRightBack,
//  Busy,
//  DoNotDisturb,
//  InACall,
//  InAConferenceCall,
//  Inactive,
//  InAMeeting,
//  Offline,
//  OffWork,
//  OutOfOffice,
//  PresenceUnknown,
//  Presenting,
//  UrgentInterruptionsOnly
void ESP32MSGraph::setPresenceAnimation() {
  if (activity.equals("Available")) {
    setAnimation(0, FX_MODE_STATIC, GREEN);
  }
  if (activity.equals("Away")) {
    setAnimation(0, FX_MODE_STATIC, YELLOW);
  }
  if (activity.equals("BeRightBack")) {
    setAnimation(0, FX_MODE_STATIC, ORANGE);
  }
  if (activity.equals("Busy")) {
    setAnimation(0, FX_MODE_STATIC, PURPLE);
  }
  if (activity.equals("DoNotDisturb") || activity.equals("UrgentInterruptionsOnly")) {
    setAnimation(0, FX_MODE_STATIC, PINK);
  }
  if (activity.equals("InACall")) {
    setAnimation(0, FX_MODE_BREATH, RED);
  }
  if (activity.equals("InAConferenceCall")) {
    setAnimation(0, FX_MODE_BREATH, RED, 9000);
  }
  if (activity.equals("Inactive")) {
    setAnimation(0, FX_MODE_BREATH, WHITE);
  }
  if (activity.equals("InAMeeting")) {
    setAnimation(0, FX_MODE_SCAN, RED);
  }
  if (activity.equals("Offline") || activity.equals("OffWork") || activity.equals("OutOfOffice") || activity.equals("PresenceUnknown")) {
    setAnimation(0, FX_MODE_STATIC, BLACK);
  }
  if (activity.equals("Presenting")) {
    setAnimation(0, FX_MODE_COLOR_WIPE, RED);
  }
}
